<template>
  <view>
    <div class="mypage-text-content" v-if="type == 'index'">
      <h3>제1조 (목적)</h3>

      본 약관은 주식회사 레드테이블(이하 “회사”)이 판매하는 여행상품 판매 및
      기타 여행 관련 서비스의 제공과 관련하여, 회사와 이용자간에 서비스의
      이용조건 및 절차, 회사와 이용자 간의 권리, 의무 및 기타 필요한 사항을
      규정함을 목적으로 합니다. 본 약관은 온라인 웹사이트, 모바일 웹사이트,
      모바일 애플리케이션을 이용하는 전자상거래에 대해서도 그 성질에 반하지 않는
      한 준용됩니다.
      <br /><br />

      <h3>제2조 (정의)</h3>

      1. “서비스”란, 구현되는 단말기(PC, 스마트폰 등 각종 유무선장치 포함)를
      통하여 회원이 사이트를 통해 여행상품을 검색, 확인하고, 매장의 이용과
      관련한 정보를 제공 받을 수 있고, 여행상품을 구매할 수 있도록 하는 제반
      서비스를 의미합니다. <br />
      2. “사이트”란, 회사가 회원이 컴퓨터, 휴대용 단말기 등 정보통신설비를
      이용하여 서비스를 이용하기 위하여 제공하는 가상의 영업장으로
      “www.redtable.global”을 말합니다.<br />
      3. “여행상품”이란, 회사가 자체적으로 기획하여 판매하는 것으로서 다수의
      국내 매장에서 판매하는 음식, 음료 등을 적절한 주제, 기준, 유형 등에 따라
      분류, 조합하여 이용자에게 판매하는 상품을 말합니다.<br />
      4. “매장”이란, 회사가 판매하는 여행상품에 포함된 음식, 음료 등을 판매하는
      음식점을 의미합니다. <br />
      5. “이용자”란, 사이트를 이용하는 회원 및 비회원을 의미합니다.<br />
      6. “회원”이란, 회사와 본 이용약관에 따라 서비스 이용계약을 체결하고,
      사이트에 회원으로 등록한 자로서, 회사가 제공하는 서비스를 이용하는
      이용자를 의미합니다. <br />
      7. “비회원”이란, 회원등록을 하지 아니하고 사이트를 이용하는 이용자를
      의미합니다. <br />
      8. “게시물”이란, 회원이 서비스를 이용함에 있어 사이트 상에 게시한 부호,
      문자, 음성 형태의 글, 사진 동영상 및 각종 파일과 링크 등을 의미합니다.
      <br /><br />

      <h3>제3조 (약관의 명시와 개정)</h3>

      1. 회사는 본 약관의 내용과 상호 및 대표자 성명, 영업소 소재지(소비자의
      불만을 처리할 수 있는 곳의 주소를 포함함), 전화번호, 팩스번호,
      전자우편주소, 사업자등록번호, 통신판매업신고번호, 개인정보관리책임자 등을
      이용자가 쉽게 알 수 있도록 사이트의 초기 서비스화면(전면)에 게시합니다.
      다만, 본 약관의 내용은 이용자가 연결화면을 통하여 볼 수 있도록 할 수
      있습니다.<br />
      2. 회사는 전자상거래 등에서의 소비자보호에 관한 법률(이하 “전자상거래법”),
      약관의 규제에 관한 법률(이하 “약관규제법”), 전자문서 및 전자거래
      기본법(이하 “전자문서법”), 정보통신망 이용촉진 및 정보보호 등에 관한
      법률(이하 “정보통신망법”), 소비자보호법 등 관련법령을 위배하지 않는
      범위에서 본 약관을 개정할 수 있습니다.<br />
      3. 회사가 본 약관을 개정할 경우에는 적용일자 및 개정사유를 명시하여 현행
      약관과 함께 사이트의 초기화면에 그 적용일로부터 7일 이전부터 적용일
      전일까지 공지합니다. 다만, 이용자에게 불리하게 약관내용을 변경하는
      경우에는 최소한 30일 이상의 사전 유예기간을 두고 공지합니다. 이 경우
      회사는 개정 전 내용과 개정 후 내용을 명확하게 비교하여 이용자가 알기
      쉽도록 표시합니다. <br />
      4. 회원은 변경된 약관에 동의하지 않을 권리가 있으며, 변경된 약관에
      동의하지 않을 경우에는 서비스의 이용을 중단하고 탈퇴를 요청할 수 있습니다.
      다만, 이용자가 회사가 제3항의 방법 등으로 별도 고지한 약관 개정 공지 기간
      내에 회사에 개정 약관에 동의하지 않는다는 명시적인 의사표시를 하지 않는
      경우 변경된 약관에 동의한 것으로 간주합니다. <br />
      5. 본 약관에서 정하지 아니한 사항과 본 약관의 해석에 관하여는
      전자상거래법, 약관규제법 등 기타 관련법령 또는 상관례에 따릅니다.<br /><br />

      <h3>제4조 (서비스의 제공 및 변경)</h3>

      1. 회사는 다음과 같은 서비스를 제공합니다. <br />
      1) 여행상품의 판매 및 여행계약의 체결 <br />
      2) 주변 식당 추천 등 여행정보 제공 <br />
      3) 여행정보의 외국어 번역 서비스<br />
      4) 기타 여행관련 정보 제공 서비스 <br />
      2. 회사는 서비스 제공과 관련한 회사 정책의 변경 등 기타 상당한 이유가 있는
      경우 등 운영상, 기술상의 필요에 따라 제공하고 있는 서비스의 전부 또는
      일부를 변경 또는 중단할 수 있습니다.
      <br />
      3. 서비스의 내용, 이용방법, 이용시간에 대하여 변경 또는 서비스의 중단이
      있는 경우에는 변경 또는 중단될 서비스의 내용 및 사유와 일자 등은 그 변경
      또는 중단 전에 사이트 또는 서비스 내 공지사항 화면 등 회원이 충분히 인지할
      수 있는 방법으로 사전에 공지합니다. <br /><br />

      <h3>제5조 (서비스 이용시간 및 중단)</h3>

      1. 서비스의 이용은 회사의 업무상 또는 기술상 특별한 사정이 발생하지 않는
      한, 연중무휴 1일 24시간을 원칙으로 합니다. 다만, 정기점검 등의 필요로
      회사가 정한 날이나 시간은 제외됩니다. 정기점검 시간은 서비스 제공화면에
      공지한 바에 따릅니다. <br />
      2. 회사는 서비스의 원활한 수행을 위하여 필요한 기간을 정하여 사전에
      공지하고 서비스를 중지할 수 있습니다. 다만, 불가피하게 긴급한 조치를
      필요로 하는 경우 사후에 통지할 수 있습니다.
      <br /><br />

      <h3>제6조 (이용계약의 성립)</h3>

      1. 이용계약은 회원이 되고자 하는 자(이하 본 조에서 “가입신청자”)가 본
      약관의 내용에 동의를 하고, 회사가 사이트에서 제공하는 가입 양식에 따라
      회원정보를 기입하여 회원가입신청을 하고, 회사가 이러한 신청에 대하여
      승인함으로써 체결됩니다.<br />
      2. 회사는 다음 각 호에 해당하는 신청에 대하여는 승인을 하지 않거나 사후에
      이용계약을 해지할 수 있습니다. <br />
      1) 가입신청자가 본 약관에 의하여 이전에 회원자격을 상실한 적이 있는 경우.
      다만, 회원자격 상실 후 3년이 경과한 자로서 회사의 회원 재가입 승낙을 얻은
      경우에는 예외로 함.<br />
      2) 실명이 아니거나 타인의 명의를 이용한 경우<br />
      3) 회사가 실명확인 절차를 실시하여 가입신청자가 신청한 성명이 실명과
      불일치함이 확인된 경우<br />
      4) 가입신청자가 실명확인 절차에 응하지 않는 경우<br />
      5) 신청내용에 허위의 정보를 기재하거나, 기재누락, 오기가 있는 경우<br />
      6) 이미 가입된 회원과 ID, 전화번호 또는 전자우편주소가 동일한 경우<br />
      7) 부정한 용도 또는 영리를 추구할 목적으로 서비스를 이용하고자 하는 경우
      <br />
      8) 14세 미만 아동이 법정대리인의 동의 없이 신청하는 경우 <br />
      9) 기타 본 약관에 위배되거나 위법 또는 부당한 이용신청임이 확인된 경우 및
      회사가 합리적인 판단에 의하여 필요하다고 인정하는 경우 <br />
      3. 제1항에 따른 회원가입신청에 있어 회사는 가입신청자에게 전문기관을 통한
      실명확인 및 본인인증을 요청할 수 있습니다.<br />
      4. 회사는 서비스 관련 설비의 여유가 없거나, 기술상 또는 업무상 문제가 있는
      경우에는 승낙을 유보할 수 있습니다.<br />
      5. 제2항 또는 제4항에 따라 회사가 회원가입신청의 승낙을 하지 아니하거나
      유보하는 경우, 회사는 이를 가입신청자에게 즉시 알립니다. <br />
      6. 회원은 회원가입 시 등록한 사항에 변경이 있는 경우, 상당한 기간 이내에
      회사에 대하여 회원정보 수정 등의 방법으로 그 변경사항을 알려야 하며,
      회원이 이를 지연한 경우 그로 인한 책임은 회원이 부담합니다. <br /><br />

      <h3>제7조 (이용제한)</h3>

      1. 회사는 다음 각 호에 해당하는 사유가 발생하는 경우 해당 회원의 서비스
      이용을 중단시키거나, 경고, 일시정지, 영구이용정지 등으로 서비스 이용을
      단계적으로 제한할 수 있습니다. <br />
      1) 회원이 회사의 서비스 운영을 고의 및 과실로 방해하는 경우 <br />
      2) 서비스의 대금결제, 기타 서비스 이용과 관련하여 회원이 부담하는 채무를
      기일에 이행하지 않는 경우 <br />
      3) 회원이 계속해서 1년 이상 로그인하지 않아 개인정보의 보호 및 운영의
      효율성을 위해 이용제한이 필요한 경우 <br />
      4) 기타 회사가 회원의 이용정지를 진행할 합리적인 사유가 있는 경우<br />
      2. 회사는 회원이 주민등록법, 개인정보보호법 등을 위반하여 다른 사람의
      명의도용 및 결제도용, 전화번호 도용, 저작권법 및 컴퓨터프로그램보호법 등을
      위반하여 불법프로그램의 제공 및 운영방해, 정보통신망법 등을 위반하여
      불법통신 및 해킹, 악성프로그램의 배포, 접속권한 초과행위 등을 하여 관련
      법령을 위반한 경우에는 즉시 영구이용정지를 하고, 이로 인한 회사의 손해에
      대한 배상을 청구할 수 있습니다.<br />
      3. 본 조에 따라 서비스 이용을 제한하거나 계약을 해지하는 경우에는 회사는
      제14조에 따라 통지합니다. <br />
      4. 회원은 본 조에 따른 이용제한 등에 대해 회사가 정한 절차에 따라
      이의신청을 할 수 있습니다. 회사는 이의신청일로부터 1개월 이내에 이의신청의
      정당성 여부를 판단하여야 하며, 이 때 이의가 정당하다고 회사가 인정하는
      경우 회사는 즉시 서비스의 이용을 재개합니다. 회사가 필요하다고 판단하는
      경우 이의신청 판단 기간은 합리적인 기간 동안 연장될 수 있습니다.<br />
      5. 회원이 본 조에 따라 서비스의 이용을 제한 받는 경우 서비스 이용을 통해
      획득한 혜택 등도 모두 이용중단 또는 소멸되며, 회사는 이에 대해 별도로
      보상하지 않습니다.<br /><br />

      <h3>제8조 (이용계약의 종료)</h3>

      1. 회원은 언제든지 회사에 해지의사를 통지함으로써 이용계약을 해지할 수
      있습니다. 회사는 회원의 해지요청에 대하여 특별한 사정이 없는 한 이를 즉시
      처리합니다. 다만, 회원이 이용계약을 해지하는 경우 회사가 회원이 작성한
      게시물을 삭제할 의무를 부담하지는 않습니다. <br />
      2. 회사는 다음 각 호에 해당하는 사유가 있는 경우 이용계약을 해지할 수
      있습니다. 이 경우 회사가 회원에게 전자우편, 전화, 팩스 기타의 방법을
      통하여 해지사유를 밝혀 해지의사를 통지함으로써 이용계약은 종료됩니다.
      다만, 회사는 해당 회원에게 해지사유에 대한 의견진술의 기회를 부여할 수
      있습니다. <br />
      1) 제6조 제2항 각 호에서 정하고 있는 이용계약의 승낙거부사유가 있음이
      확인된 경우 <br />
      2) 회원이 회사나 다른 회원 기타 타인의 권리나 명예, 신용 기타 정당한 권리,
      이익을 침해하는 행위를 한 경우<br />
      3) 기타 회원이 본 약관 및 회사의 공지된 정책에 위배되는 행위를 하거나 본
      약관에서 정한 해지사유가 발생한 경우 <br /><br />

      <h3>제9조 (여행상품의 주문/구매신청)</h3>

      1. 회원은 회사가 정하는 규정에 따라 아래의 절차로 여행상품을 주문합니다.
      <br />
      1) 여행상품의 검색 및 선택 <br />
      2) 여행상품에 대한 약관, 안내서 등의 제공 <br />
      3) 성명, 주소, 전화번호, 전자우편주소 등 개인정보의 입력 <br />
      4) 이 약관 및 여행상품에 대한 개별 약관에 동의하고 위 제3호의 사항을
      확인하거나 거부하는 표시(예, 마우스 클릭)<br />
      5) 여행상품의 구매신청 및 이에 관한 확인 또는 회사의 확인에 대한 동의
      <br />
      6) 결제방법의 선택 <br />
      7) 여행상품의 구매내용 확인 <br />
      2. 여행상품의 주문이 완료되면, 회사는 회원이 주문한 여행상품의 상세 내역을
      전자우편 또는 사이트의 회원계정에서 확인할 수 있는 방법으로 회원에게
      발송합니다.<br />
      3. 회원은 여행상품의 주문 시 회사와 사이에 별도의 여행계약을 체결하여야
      합니다.<br />
      4. 주문한 여행상품의 상세 내역의 발송 작업은 회사가 쉬는 날 및 처리 과정의
      상황에 따라 변경될 수 있으며, 이러한 경우에는 사전에 공지된 내용을
      따릅니다.<br />
      5. 결제와 관련하여 회원이 입력한 정보 및 그 정보와 관련하여 발생한 책임과
      불이익은 전적으로 회원이 부담하여야 합니다.<br /><br />

      <h3>제10조 (결제수단)</h3>

      1. 회원은 회사에서 주문한 상품에 대한 대금지급을 다음 각 호의 하나의
      방법으로 할 수 있습니다. <br />
      1) 신용카드 결제 <br />
      2) 외화입금(Paypal / Alipay 등) <br />
      3) 기타 회사가 인정한 방법으로서 사이트에 적용된 결제방법 <br />
      2. 회원이 주문대금의 결제와 관련하여 입력한 정보 및 그 정보와 관련하여
      발생한 책임과 불이익은 전적으로 회원이 부담합니다. <br /><br />

      <h3>제11조 (게시물의 저작권 및 배타적 이용허락)</h3>

      1. 회원이 직접 작성 및 등록한 평가점수, 리뷰, 답글, 사진 등의 게시물의
      저작권은 이를 작성한 회원 본인에게 있으며, 해당 게시물이 타인의 저작권을
      침해하는 경우 그에 대한 책임은 회원 본인이 부담합니다. <br />
      2. 회사는 회원이 게시하거나 등록하는 게시물의 내용이 다음 각 호에
      해당한다고 판단되는 경우 해당 게시물을 사전통지 없이 삭제 또는
      임시조치(블라인드 처리 등)할 수 있습니다. <br />
      1) 다른 회원 또는 제3자를 비방하거나 명예를 손상시키는 내용인 경우 <br />
      2) 공공질서 및 미풍양속에 위반되는 내용일 경우 <br />
      3) 범죄적 행위에 결부된다고 인정되는 경우 <br />
      4) 회사의 저작권, 제3자의 저작권 등 기타 권리를 침해하는 내용인 경우
      <br />
      5) 회원이 사이트와 게시판에 음란물을 게재하거나 음란사이트를 링크하는 경우
      <br />
      6) 회사로부터 사전 승인 받지 아니한 상업광고(비교광고를 포함함), 판촉
      내용을 게시하는 경우 <br />
      7) 해당 상품과 관련 없는 내용인 경우 <br />
      8) 정당한 사유 없이 회사 또는 매장의 영업을 방해하는 내용을 기재하는 경우
      <br />
      9) 자신의 업소를 홍보할 목적으로 허위 또는 과장된 게시물을 게재하는 경우
      <br />
      10) 의미 없는 문자 및 부호에 해당하는 경우 <br />
      11) 제3자 등으로부터 권리침해신고가 접수된 경우<br />
      12) 관계법령에 위반된다고 판단되는 경우<br />
      3. 회원은 회사에게 자신이 작성한 게시물을 독점적으로 이용할 수 있는 권리를
      부여합니다. 이에 따라 회사는 회원이 작성한 게시물을 검색노출, 판촉, 홍보
      기타의 자료로 무상으로 영구적으로 이용할 수 있으며, 필요한 범위 내에서
      게시물의 일부를 수정, 복제 및 편집할 수 있습니다.<br />
      4. 회원은 회사에게 언제든지 자신이 작성한 게시물에 대해 삭제, 검색결과
      제외, 비공개를 요구할 수 있으며, 마케팅, 판촉, 홍보 및 기타 자료에
      사용하지 않을 것을 요청할 수 있습니다.<br /><br />

      <h3>제12조 (저작권 등의 귀속)</h3>

      1. 회사가 작성한 저작물에 대한 저작권 및 기타 지적 재산권은 회사에
      귀속됩니다.<br />
      2. 이용자는 사이트에 게재된 정보 중 회사에 저작권 및 기타 지적 재산권이
      귀속된 정보를 회사의 사전 승낙 없이 복제, 송신, 출판, 배포, 방송 및 기타
      방법에 의하여 영리 또는 비영리 목적으로 이용하거나 제3자에게 이용하게
      하여서는 안됩니다.<br /><br />

      <h3>제13조 (개인정보보호)</h3>

      1. 회사는 회원의 개인정보를 보호하기 위하여 정보통신망법 및 개인정보보호법
      등 관계 법령에서 정하는 바를 준수합니다. <br />
      2. 회사는 회원의 개인정보를 보호하기 위한 개인정보취급방침을 수립하여
      서비스 초기화면에 게시합니다. 다만, 개인정보취급방침의 구체적 내용은
      연결화면을 통하여 볼 수 있습니다.<br />
      3. 회사는 관련법령 및 개인정보취급방침에 따라 회원의 개인정보를 최대한
      보호하기 위하여 노력합니다. <br />
      4. 회사의 공식 사이트 이외의 링크된 사이트에서는 회사의 개인정보취급방침이
      적용되지 않습니다. 링크된 사이트 및 주문 상품이나 서비스를 제공하는
      제3자의 개인정보 취급과 관련하여는 해당 사이트 및 해당 제3자의
      개인정보취급방침을 확인할 책임이 회원에게 있으며, 회사는 이에 대하여
      책임을 부담하지 않습니다. <br /><br />

      <h3>제14조 (회원에 대한 통지)</h3>

      1. 회사가 회원에 대한 통지를 하는 경우, 회원이 가입신청 시 회사에 제출한
      전자우편 주소나 휴대전화번호 등으로 할 수 있습니다. <br />
      2. 회사는 불특정다수 회원에 대한 통지의 경우, 1주일 이상 사이트에
      게시함으로써 개별 통지에 갈음할 수 있습니다. <br /><br />

      <h3>제15조 (회사의 의무)</h3>

      1. 회사는 관련 법령과 본 약관이 금지하거나 공공질서, 미풍양속에 반하는
      행위를 하지 않으며, 본 약관이 정하는 바에 따라 지속적이고 안정적으로
      서비스를 제공하기 위하여 최선을 다합니다.<br />
      2. 회사는 회원이 안전하게 서비스를 이용할 수 있도록 회원의
      개인정보(신용정보 포함) 보호를 위한 보안 시스템을 갖추어야 하며
      개인정보취급방침을 공시하고 준수합니다.<br />
      3. 회사는 서비스 이용과 관련하여 발생하는 회원의 불만 및 피해구제요청을
      적절하게 처리할 수 있도록 필요한 인력 및 시스템을 구비하며, 서비스 이용과
      관련하여 회원으로부터 제기된 의견이나 불만이 정당하다고 인정할 경우에는
      이를 처리하여야 합니다. 회원이 제기한 의견이나 불만사항에 대해서는
      전자우편 등을 통하여 회원에게 처리과정 및 결과를 전달합니다.<br />
      4. 회사는 회원으로부터의 거래지시가 있음에도 불구하고 천재지변, 회사의
      귀책사유가 없는 정전, 화재, 통신장애 기타의 불가항력의 사유로 처리
      불가능하거나 지연된 경우에는 회원에 대하여 이로 인한 책임을 지지
      아니합니다. <br /><br />

      <h3>제16조 (회원의 의무)</h3>

      1. 회원은 서비스 이용과 관련하여 다음 각 호의 행위를 해서는 안 됩니다.<br />
      1) 상품의 구매 신청 또는 내용 변경 시 허위 내용을 기재하는 행위 <br />
      2) 서비스의 정상적인 운영 및 회사의 영업을 방해하는 행위<br />
      3) 본 약관을 위반하여 매장 및 제3자에게 손해를 끼치는 행위<br />
      4) 개인정보의 등록 또는 변경 시 허위 내용을 등록하거나 타인의 정보를
      도용하는 등 부정한 방법을 사용한 행위<br />
      5) 회사가 게시한 정보를 변경하는 행위<br />
      6) 회사가 정한 정보 이외의 정보(컴퓨터 프로그램 등) 등의 송신 또는 게시<br />
      7) 제3자의 지적 재산권 등 권리를 침해하는 행위<br />
      8) 제3자의 명예를 손상하거나 업무를 방해하는 행위<br />
      9) 서비스를 방해하거나 사이트를 불법적으로 침해하는 행위<br />
      10) 사실관계를 왜곡하는 정보를 제공하는 행위<br />
      11) 외설 또는 폭력적인 메시지, 화상, 음성, 기타 공서양속에 반하는 정보를
      서비스에 공개 또는 게시하는 행위<br />
      12) 회사의 동의 없이 영리를 목적으로 서비스를 사용하는 행위<br />
      13) 매장 정보, 에디터 평, 사진, 리뷰 등 서비스에 게시된 게시물을 회사의
      동의 없이 변형하거나 영리 또는 비영리 용도로 사용하는 행위<br />
      14) 기타 본 약관 및 관련 법령을 위반하는 행위<br />
      2. 회원은 관련법령, 본 약관의 규정, 이용안내 및 서비스와 관련하여 공지한
      주의사항, 회사가 통지하는 사항 등을 준수하여야 하며, 기타 회사의 업무에
      방해되는 행위를 하여서는 안 됩니다.<br /><br />

      <h3>제17조 (회사의 책임제한)</h3>

      1. 회사는 천재지변, 디도스(DDOS), IDC장애, 기간통신사업자의 회선 장애 또는
      이에 준하는 불가항력으로 인하여 서비스를 제공할 수 없는 경우에는 서비스
      제공에 관한 책임이 면제됩니다.<br />
      2. 회사는 회원의 귀책사유로 인한 서비스 이용의 장애에 대하여는 책임을 지지
      않습니다.<br />
      3. 회사는 회원이 서비스를 통한 상품의 주문과 관련하여 매장에서 발생한
      문제로 인해 회원에게 발생한 손해에 대하여는 책임을 지지 않습니다.<br />
      4. 회사는 매장 또는 회원이 서비스와 관련하여 임의로 게재한 정보, 자료,
      사실의 신뢰도, 정확성 등의 내용에 관하여는 책임을 지지 않습니다.<br />
      5. 회사는 회원 간 또는 회원과 제3자 상호간에 서비스를 매개로 하여 거래
      등을 한 경우에는 책임이 면제됩니다.<br />
      6. 회사는 무료로 제공되는 서비스 이용과 관련하여 관련법령에 특별한 규정이
      없는 한 책임을 지지 않습니다.<br /><br />

      <h3>제18조 (분쟁조정)</h3>

      1. 회사는 회원으로부터 소정의 절차에 의해 제기되는 의견이나 불만이
      정당하다고 인정할 경우에는 적절한 절차를 거쳐 처리합니다. 다만, 처리 시
      일정 기간이 소요될 경우 회원에게 그 사유와 처리 일정을 즉시 통보
      합니다.<br />
      2. 회원은 회사의 분쟁처리결과에 대하여 이의가 있을 경우 소비자기본법에
      따른 한국소비자원의 소비자분쟁조정위원회, 전자문서법에 의하여 설치된
      전자거래분쟁조정위원회에 전자거래서비스의 이용과 관련한 분쟁조정을 신청할
      수 있습니다.<br /><br />

      <h3>제19조 (손해배상)</h3>

      회사와 이용자는 본 약관을 위반함으로써 발생한 모든 책임을 각자가 부담하며
      이로 인하여 상대방에게 손해를 입힌 경우에는 이를 배상하여야 합니다.<br /><br />

      <h3>제20조 (준거법 및 재판관할)</h3>

      1. 본 약관과 관련된 사항에 대하여는 대한민국 법을 준거법으로 합니다.<br />
      2. 회사와 회원간 발생한 분쟁은 대한민국 서울에서 대한상사중재원의
      국제중재규칙에 따라 한국어를 사용하는 중재로 해결합니다. 중재인이 내린
      판정은 최종적인 것으로 관련당사자 쌍방을 구속합니다.
      <br /><br />

      <h3>제21조 (기타)</h3>

      본 약관에 명시되지 않은 사항은 전자상거래법 기타 관련 법령의 규정 및
      회사의 여행약관 등에 의합니다. <br /><br />

      <h3>제22조 (회사의 연락처)</h3>

      1. 상호: ㈜레드테이블 <br />
      2. 대표자: 도해용<br />
      3. 주소: 서울시 중구 명동3길 6 개양빌딩 7층<br />
      4. 전화번호: 02-6694-7955<br />
      5. 이메일: contact@redtable.kr<br /><br />

      부 칙<br />

      제1조 (시행일) <br />

      본 약관은 2017.1.1 부터 시행한다. <br /><br />
    </div>

    <div class="mypage-text-content" v-if="type == 'privacy'">
      <br />
      주식회사 레드테이블(이하 "회사")은 이용자의 개인정보를 중요시하며,
      「정보통신망 이용촉진 및 정보보호 등에 관한 법률」 등 개인정보와 관련된
      법령 규정을 준수하고 있습니다. 회사는 개인정보취급방침을 통하여 이용자가
      제공하는 개인정보가 어떠한 용도와 방식으로 이용되고 있으며, 개인정보가
      유출되거나 남용되지 않도록 적극적으로 보호하기 위해 어떠한 조치가 취해지고
      있는지 알려드립니다. 회사는 개인정보취급방침을 개정하는 경우 웹사이트
      공지사항(또는 개별공지)을 통하여 공지할 것입니다. <br /><br />

      <h3>1. 수집하는 개인정보 항목 및 수집방법</h3>

      가. 수집항목<br />
      (1) 필수항목: ID, 비밀번호, 성명, 휴대폰 번호, 전자우편 주소,
      신용카드정보, 은행계좌정보, 휴대폰 번호(휴대폰 결제 시), 현금영수증정보<br />
      (2) 선택항목: 예약 내역, 유료 서비스 이용 과정에서 결제 정보 및 결제
      기록<br /><br />

      서비스 이용 과정이나 서비스 제공 업무 처리 과정에서 이용자 상태정보,
      사용자 아이디, 서비스 이용기록, 접속 로그, 방문 일시, 쿠키, 접속 IP 정보,
      불량 이용 기록과 같은 정보들이 자동으로 생성되어 수집될 수 있습니다.<br /><br />

      나. 수집방법<br />
      (i) 회원가입, 이벤트 응모 등을 통한 수집, (ii) 회원정보수정, (iii) 서면,
      팩스, 전화, 웹사이트 등의 방법으로 고객센터 문의하기, (iv) 애플리케이션을
      실행 또는 사용함으로써 자동으로 수집, (v) 서비스 가입이나 사용 중 이용자의
      자발적 제공을 통한 수집<br /><br />

      <h3>2. 개인정보의 수집 및 이용목적</h3>

      회사는 수집한 개인정보를 다음의 목적을 위해 활용합니다. 이용자가 제공한
      모든 정보는 하기 목적에 필요한 용도 이외로는 사용되지 않으며 이용 목적이
      변경될 시에는 이용자로부터 사전 동의를 구할 것입니다.<br /><br />

      가. 서비스의 제공<br />
      상품의 구매 및 요금 결제, 금융거래 본인 인증, 기타 금융 서비스,
      전자상품권의 제공, 특정 맞춤 서비스 제공, 결제대금 추심 등<br /><br />

      나. 회원 관리<br />
      회원제 서비스 이용에 따른 회원가입, 본인확인, 개인 식별, 불량회원의 부정
      이용 방지와 비인가 사용 방지, 가입 의사 확인, 연령확인, 불만처리 등
      민원처리, 고지사항 전달, 가입 및 가입횟수 제한, 14세 미만 회원에 대한 법정
      대리인 확인, 분쟁 해결을 위한 기록보존<br /><br />

      다. 마케팅 및 광고에 활용<br />
      신규 서비스 개발 및 맞춤 서비스 제공 및 마케팅, 인구통계학적 특성에 따른
      서비스 제공 및 광고 게재, 접속 빈도 파악 등 회원의 서비스 이용에 대한
      통계, 입점업체의 상권 분석 등 마케팅 분석 서비스 활용을 위한 통계<br /><br />

      <h3>3. 개인정보의 제3자 제공</h3>

      가. 회사는 이용자로부터 사전에 동의를 얻어 상품 판매 업체에 아래와 같이
      귀하의 개인정보를 제공하고 있습니다. <br /><br />

      제공 받는 자 이용목적 제공정보 보유 및 이용기간<br />
      [사업자]<br />
      [전체보기] 본인확인, 상품의 제공, 고객 서비스 제공 및 계약이행을 위해
      필요한 업무의 처리 1) 구매자정보(성명, 휴대폰 번호)<br />
      2) 구매, 반품, 교환정보<br />
      3) 기타 전자상품권 정보 서비스 제공기간 (관계법령의 규정에 의하여 보존할
      필요가 있는 경우 및 사전 동의를 득한 경우 해당 보유 기간)<br />
      나. 그 외에 회사는 이용자로부터 사전에 동의를 얻은 경우 및 법원, 행정기관
      등으로부터 법령의 규정에 의거하여 요구가 있거나, 수사 목적으로 법령에
      정해진 절차와 방법에 따라 수사기관 및 감독당국의 요구가 있는 경우, 요금
      정산을 위하여 필요한 경우 이용자의 개인정보를 해당 제3자에게 제공할 수
      있습니다. <br /><br />

      <h3>4. 개인정보의 취급 위탁</h3>

      가. 회사는 이용자에게 서비스를 제공하는 데에 반드시 필요한 업무 중 일부를
      외부 업체에게 위탁하여 운영하고 있습니다. 이 때 회사는 (i) 개인정보
      취급위탁을 받는 자, (ii) 개인정보 취급위탁을 하는 업무의 내용을 이용자에게
      미리 알리고 동의를 받습니다.<br /><br />

      나. 회사는 서비스의 제공에 관한 계약을 이행하고 이용자 편의 증진 등을
      위하여 필요한 경우 개인정보취급방침에 따라 가항에 기재된 각 사항을
      공개함으로써 고지절차와 동의절차를 거치지 아니하고 개인정보의 취급을
      타인에게 위탁할 수 있습니다.<br /><br />

      다. 회사는 개인정보의 처리와 관련하여 아래와 같이 업무를 위탁하고 있으며,
      관계법령에 따라 위탁 계약 시 개인정보가 안전하게 관리될 수 있도록 필요한
      조치를 하고 있습니다. 회사는 위탁 계약 시 수탁자의 개인정보 보호조치
      능력을 고려하고, 개인정보의 안전한 관리 및 파기 등 수탁자의 의무 이행
      여부를 주기적으로 확인합니다. 또한 위탁처리하는 개인정보는 원활한 서비스를
      제공하기 위하여 필요한 최소한의 정보에 국한됩니다.<br /><br />

      수탁자 위탁업무<br />
      [Alipay] Tenpay 전자결제<br />
      EXIMBAY 신용카드 결제처리<br />
      NicePay 신용카드 결제처리<br />

      <h3>5. 개인정보의 보유 및 이용기간</h3>

      가. 회사는 원칙적으로 개인정보 수집 및 이용목적이 달성된 후에는 해당
      정보를 지체없이 파기합니다. 단 아래의 경우에는 법령에서 규정한 개인정보의
      보존기간 동안 수집한 개인정보의 전부 또는 일부를 보존합니다. <br /><br />

      관련 법률 목적 수집항목 보유기간<br />
      통신비밀보호법<br />
      제12조의 2 법원의 영장을 받아 수사기관이 요청시 제공 로그기록, IP 등
      3개월<br />
      전자상거래등에서의 소비자보호에 관한 법률<br />
      제6조 소비자의 불만 또는 분쟁처리에 관한 기록 소비자 식별정보,분쟁처리
      기록 등 3년 대금결제 및 재화 등의 공급에 관한 기록 소비자
      식별정보,계약/청약철회 기록 등 5년 계약 또는 청약철회 등에 관한 기록 5년
      표시∙광고에 관한 기록 제공된 광고에 대한 기록 등 6개월<br /><br />

      국세기본법<br />
      제85조의3 국세 부과 제척기간 계산 국세 증빙자료 등 10년<br />
      국세징수권 등 소멸시효 계산 과세표준과 세액의 신고자료 등 5년<br /><br />
      부가가치세법<br />
      제71조 장부, 세금계산서, 수입세금계산서, 영수증 등 부가가치세의 과세표준과
      세액의 신고자료, 현금영수증 자료 등 5년<br />
      전자금융거래법<br />
      제22조 전자금융거래기록 확인 전자금융거래에 관한 기록, 상대방에 관한 정보
      등 5년<br /><br />

      나. 그 외에 회사는 회사 방침에 따라 아래와 같이 정보를 보유합니다.<br />
      • 부정거래 기록<br />
      • 보존이유: 부정거래의 배제<br />
      • 보존기간: 6개월<br />
      • 보존항목: 성명, 휴대폰번호, 전자우편 주소, 생년월일, 부정거래사유, 탈퇴
      시 회원 상태값 등<br />
      ※ 부정거래: 법령, 회사와 이용자 간의 서비스 이용약관 또는 공서양속을
      위반하거나, 기타 회사, 회원 또는 타인의 권리나 이익을 침해하는 방법이나
      내용의 거래를 말함.<br /><br />

      <h3>6. 개인정보의 파기절차 및 방법</h3>

      회사는 원칙적으로 개인정보 수집 및 이용목적이 달성된 후 또는
      서비스이용계약 해지 시(탈퇴신청, 직권탈퇴 등)에는 상기에 명시한 정보보유
      사유에 따라 일정기간 저장하는 자료를 제외하고는 해당 정보를 지체 없이
      파기합니다. 파기절차 및 방법은 다음과 같습니다.<br /><br />

      가. 파기절차<br />
      이용자가 회원가입 등을 위해 입력한 정보는 목적이 달성된 후 별도의 DB로
      옮겨져(종이의 경우 별도의 서류함) 내부 방침 및 기타 관련 법령에 의한
      정보보호 사유에 따라(보유 및 이용기간 참조) 일정 기간 저장된 후
      파기됩니다. 별도 DB로 옮겨진 개인정보는 법률에 의한 경우가 아니고서는 다른
      목적으로 이용되지 않습니다.<br /><br />

      나. 파기방법<br />
      전자적 파일형태로 저장된 개인정보는 기록을 재생할 수 없는 기술적 방법을
      사용하여 삭제합니다. 종이에 출력된 개인정보는 분쇄기로 분쇄하거나 소각을
      통하여 파기합니다. <br /><br />

      다. 미이용 회원의 개인정보 파기<br />
      회사는 1년 동안 회사의 서비스를 이용하지 않은 이용자의 개인정보는
      「정보통신망 이용촉진 및 정보보호등에 관한 법률」 제29조에 근거하여
      이용자에게 사전통지하고 개인정보를 파기하거나 별도로 분리하여 저장합니다.
      다만, 「통신비밀보호법」, 「전자상거래 등에서의 소비자보호에 관한 법률」
      등의 관계법령의 규정에 의하여 보존할 필요가 있는 경우 관계법령에서 규정한
      일정한 기간 동안 이용자 개인정보를 보관합니다. 회사는 위 기간 만료 30일
      전까지 개인정보가 파기되거나 분리되어 저장관리되는 사실과 기간 만일 및
      해당 개인정보의 항목을 공지사항, 전자우편 등의 방법으로 이용자에게
      알립니다. 이를 위해 이용자는 회사에 정확한 연락처 정보를 제공/수정하여야
      합니다. <br /><br />

      <h3>7. 이용자 및 법정대리인의 권리와 그 행사방법</h3>

      가. 이용자 및 법정대리인은 언제든지 등록되어 있는 자신 혹은 당해 만 14세
      미만 아동의 개인정보를 조회하거나 수정할 수 있으며 가입해지를 요청할 수도
      있습니다.<br /><br />

      나. 이용자 혹은 만 14세 미만 아동의 개인정보 조회/수정을 위해서는
      ‘개인정보변경’(또는 '회원정보수정' 등)을 가입해지(동의철회)를 위해서는
      ‘회원탈퇴’를 클릭하여 본인 확인 절차를 거친 후 직접 열람, 정정 또는 탈퇴가
      가능합니다. 혹은 개인정보관리책임자에게 서면, 전화 또는 이메일로
      연락하시면 지체 없이 조치하겠습니다. <br /><br />

      다. 이용자가 개인정보의 오류에 대한 정정을 요청한 경우에는 정정을 완료하기
      전까지 당해 개인정보를 이용 또는 제공하지 않습니다. 또한 잘못된 개인정보를
      제3자에게 이미 제공한 경우에는 정정 처리결과를 제3자에게 지체 없이
      통지하여 정정이 이루어지도록 하겠습니다. <br /><br />

      라. 회사는 이용자 혹은 법정 대리인의 요청에 의해 해지 또는 삭제된
      개인정보는 "5. 개인정보의 보유 및 이용기간"에 명시된 바에 따라 처리하고 그
      외의 용도로 열람 또는 이용할 수 없도록 처리하고 있습니다.<br /><br />

      <h3>8. 개인정보 자동수집 장치의 설치, 운영 및 그 거부에 관한 사항</h3>

      가. 쿠키의 수집<br />
      회사는 개인화되고 맞춤화된 서비스를 제공하기 위해서 이용자의 정보를
      저장하고 수시로 불러오는 '쿠키(cookie)'를 사용합니다. 쿠키는 웹사이트를
      운영하는데 이용되는 서버가 이용자의 브라우저에 보내는 아주 작은 텍스트
      파일로서 이용자 컴퓨터의 하드디스크에 저장됩니다. 이용자가 웹 사이트에
      방문할 경우 웹 사이트 서버는 이용자의 하드 디스크에 저장되어 있는 쿠키의
      내용을 읽어 이용자의 환경설정을 유지하고 맞춤화된 서비스를 제공하기 위해
      이용됩니다. 쿠키는 개인을 식별하는 정보를 자동적/능동적으로 수집하지
      않으며, 이용자는 이러한 쿠키의 저장을 거부하거나 삭제할 수 있습니다.<br /><br />

      나. 쿠키의 설치/운영 및 거부 방법<br />
      이용자는 쿠키 설치에 대한 선택권을 가지고 있습니다. 따라서, 이용자는 웹
      브라우저에서 옵션을 설정함으로써 모든 쿠키의 저장을 허용하거나, 쿠키가
      저장될 때마다 확인을 거치거나, 아니면 모든 쿠키의 저장을 거부할 수도
      있습니다. 다만, 쿠키의 저장을 거부할 경우에는 개인별 맞춤추천 서비스 등
      일부 서비스 이용에 어려움이 있을 수 있습니다.<br />
      - 설정방법:<br />
      • 인터넷 익스플로어의 경우: 웹 브라우저 상단의 [도구] &gt; [인터넷 옵션]
      &gt; [개인정보] &gt; [개인정보취급 수준] 설정<br /><br />

      <h3>9. 이용자의 의무</h3>
      가. 이용자는 자신의 개인정보를 보호할 의무가 있으며, 회사의 귀책사유가
      없이 ID, 비밀번호, 접근매체 등의 양도대여분실이나 로그인 상태에서 이석
      등 이용자 본인의 부주의나 관계법령에 의한 보안조치로 차단할 수 없는
      방법이나 기술을 사용한 해킹 등 회사가 상당한 주의에도 불구하고 통제할 수
      없는 인터넷 상의 문제 등으로 개인정보가 유출되어 발생한 문제에 대해 회사는
      책임을 지지 않습니다.<br /><br />

      나. 이용자는 자신의 개인정보를 최신의 상태로 유지해야 하며, 이용자의
      부정확한 정보 입력으로 발생하는 문제의 책임은 이용자 자신에게 있습니다.<br /><br />

      다. 타인의 개인정보를 도용한 회원가입 또는 주민등록번호 등을 도용하여
      물품거래 시 이용자자격 상실과 함께 「주민등록법」에 의거하여 처벌될 수
      있습니다.<br /><br />

      라. 이용자는 아이디, 비밀번호 등에 대해 보안을 유지할 책임이 있으며
      제3자에게 이를 양도하거나 대여할 수 없습니다. 이용자는 회사의
      개인정보보호정책에 따라 보안을 위해 비밀번호의 주기적 변경에 협조할 의무가
      있습니다.<br /><br />

      마. 이용자는 회사의 서비스를 이용한 후에는 반드시 로그인 계정을 종료하고
      웹 브라우저 프로그램을 종료해야 합니다.<br /><br />

      바. 이용자는 「정보통신망 이용촉진 및 정보보호 등에 관한 법률」,
      「개인정보보호법」, 「주민등록법」 등 기타 개인정보에 관한 법률을
      준수하여야 합니다.<br /><br />

      <h3>10. 개인정보관리책임자</h3>

      회사는 이용자의 개인정보를 보호하고 개인정보와 관련한 불만을 처리하기
      위하여 아래와 같이 개인정보관리책임자를 지정하고 있습니다. 이용자는 회사의
      서비스를 이용하는 과정에서 발생하는 모든 개인정보보호 관련 민원을
      개인정보관리책임자에게 신고할 수 있습니다. 회사는 이용자들의 신고사항에
      대해 신속하게 충분한 답변을 드릴 것입니다. <br /><br />

      개인정보관리책임자 <br /><br />

      성명: 김성종<br />
      전화번호: 82-2-6964-7955<br />
      이메일: contact@redtable.kr<br />
    </div>

    <div class="mypage-text-content" v-if="type == 'refund'">
      <h3>제1조 (청약철회 등)</h3>

      1. 이용약관 제10조에서 정한 결제수단을 통하여 상품의 주문을 청약한 회원은,
      청약 후 결제가 완료되어 상품권을 제공 받은 날로부터 7일 이내에는 그 청약의
      철회를 할 수 있습니다.<br />
      2. 회원은 상품권에 기재된 주문내역이 상품의 주문 시 확인한 표시∙광고
      내용과 다르거나 주문 내용과 다르게 이행된 때에는 상품권을 제공 받은 날부터
      3개월 이내, 그 사실을 안 날 또는 알 수 있었던 날부터 30일 이내에
      청약철회를 할 수 있습니다.<br />
      3. 신용카드와 외화입금으로 결제한 회원이 청약철회 시 기존에 결제하였던
      내역을 취소하며, 취소 시점에 따라 제13조에서 정하는 청약철회 수수료 결제를
      재승인 합니다. 이 경우 청약철회 시점과 해당 카드사의 환불 처리기준에 따라
      취소금액의 환급 방법과 환급일은 다소 차이가 있을 수 있으며, 사용한
      신용카드의 환불 정책은 신용카드 회사와 외화입금 회사에 직접 문의해 주시기
      바랍니다.<br />
      4. 회사는 주문 결제 시 대금을 지급받은 내역이 있는 경우 제1항의 청약철회를
      수신한 날로부터 3 영업일 이내에 지급받은 대금을 환급합니다. 이 경우 회사가
      그 환급을 지연하는 때에는 그 지연기간에 대하여 전자상거래법 시행령에서
      정하는 지연배상금 이율을 곱하여 산정한 지연이자를 지급합니다. <br />
      5. 회사는 제5항에 따른 대금을 환급함에 있어서 회원이 신용카드 등의
      결제수단으로 대금을 지급한 때에는 지체 없이 당해 결제수단을 제공한
      사업자(이하 “결제업자”)로 하여금 회원에 대한 대금의 청구를 정지 또는
      취소하도록 요청합니다. 또한 회사가 이미 결제업자로부터 대금을 지급 받은
      때에는 지체없이 그 대금을 결제업자에게 반환하고 그 사실을 회원에게
      알립니다.<br /><br />

      <h3>제2조 (청약철회 수수료)</h3>

      1. 회원이 청약의 철회나 예약의 변경 없이 상품권 주문 시 지정한 방문예정
      일시에 상품권을 사용하지 못한 경우 환불은 불가능합니다.<br />
      2. 제12조 제1항에 따른 청약철회 시 발생하는 수수료는 아래와 같습니다. 단,
      별도로 청약철회 수수료가 명시되어 있는 상품권의 경우에는 해당 수수료
      규정이 본 약관에 우선합니다.<br />
      1) 방문예정일 기준 2일 전까지 청약철회 시: 수수료 없음<br />
      2) 방문예정일 기준 1일 전까지 청약철회 시: 상품 금액의 10% 수수료 발생<br />
      3) 방문예정일 기준 당일 ~ 방문예정일시 기준 3시간 이전까지 청약철회 시:
      상품 금액의 20% 수수료 발생<br />
      4) 방문예정일시 기준 3시간 ~ 30분 이전까지 청약철회 시: 상품 금액의 30%
      수수료 발생<br />
      5) 방문예정일 기준 30분 이내 예약 취소 시: 상품 금액의 50% 수수료 발생<br />
      3. 1회 이상 변경된 예약의 청약을 철회하는 경우, 발생한 모든 예약 변경
      중에서 예약 변경을 시도한 시점과 방문예정 일시가 가장 가까운 시점을
      기준으로 청약철회 수수료가 부과됩니다.<br />
      4. 회원이 상품권 주문 시 지정한 방문예정일 이후에는 청약철회가 불가능하며,
      별도의 청약철회 또는 변경 없이 매장에서 상품을 사용하지 않은 경우 환불이
      불가능합니다.<br /><br />
    </div>

    <view class="img-info" v-if="type == 'usage'">
      <image mode="widthFix" :src="imageHost"></image>
    </view>
  </view>
</template>

<script>
export default {
  data() {
    return {
      type: "index",
      imageHost:
        this.$imageHost + "/asset/common/usage/commerce/usage_zh-Hans_2211.jpg",
    };
  },
  onLoad(option) {
    this.type = option.type;
    const arr = [
      {
        name: "使用条款",
        id: "index",
      },
      {
        name: "个人信息保护政策",
        id: "privacy",
      },
      {
        name: "退款政策",
        id: "refund",
      },
      {
        name: "订购及使用方法",
        id: "usage",
      },
    ];
    const currentObj = arr.filter((item) => item.id === this.type);
    uni.setNavigationBarTitle({
      title: currentObj[0].name,
    });
  },
  methods: {},
};
</script>

<style lang="scss">
.mypage-text-content {
  padding-left: 14px;
  padding-right: 14px;
  padding-top: 61px;
  font-weight: 300;
  line-height: 1.7;

  h3 {
    margin-top: 1em;
    margin-bottom: 1em;
  }
}
.img-info {
  margin-top: 20rpx;
  display: flex;
  flex-wrap: wrap;
  justify-content: space-around;
  image {
    width: 100%;
    height: auto;
    margin-bottom: 20rpx;
  }
}
</style>
